flowforge/load-testing/results/after_k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/webhook_load.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 2m40s max duration (incl. graceful stop):
              * ramp: Up to 80 looping VUs for 2m30s over 2 stages (gracefulRampDown: 30s, gracefulStop: 10s)

time="2026-06-15T17:51:01Z" level=info msg="setup: workflow=592b7a13-d8ec-42dc-8708-ed9def7f1700 delayMs=150 webhookKey=VXByVGvf..." source=console

running (0m00.8s), 01/80 VUs, 123 complete and 0 interrupted iterations
ramp   [   0% ] 01/80 VUs  0m00.7s/2m30.0s

running (0m01.8s), 02/80 VUs, 220 complete and 0 interrupted iterations
ramp   [   1% ] 02/80 VUs  0m01.7s/2m30.0s

running (0m02.8s), 02/80 VUs, 313 complete and 0 interrupted iterations
ramp   [   2% ] 02/80 VUs  0m02.7s/2m30.0s

running (0m03.8s), 03/80 VUs, 473 complete and 0 interrupted iterations
ramp   [   2% ] 03/80 VUs  0m03.7s/2m30.0s

running (0m04.8s), 04/80 VUs, 785 complete and 0 interrupted iterations
ramp   [   3% ] 04/80 VUs  0m04.7s/2m30.0s

running (0m05.8s), 04/80 VUs, 1058 complete and 0 interrupted iterations
ramp   [   4% ] 04/80 VUs  0m05.7s/2m30.0s

running (0m06.8s), 05/80 VUs, 1427 complete and 0 interrupted iterations
ramp   [   4% ] 05/80 VUs  0m06.7s/2m30.0s

running (0m07.8s), 06/80 VUs, 1842 complete and 0 interrupted iterations
ramp   [   5% ] 06/80 VUs  0m07.7s/2m30.0s

running (0m08.8s), 06/80 VUs, 2118 complete and 0 interrupted iterations
ramp   [   6% ] 06/80 VUs  0m08.7s/2m30.0s

running (0m09.8s), 07/80 VUs, 2524 complete and 0 interrupted iterations
ramp   [   6% ] 07/80 VUs  0m09.7s/2m30.0s

running (0m10.8s), 08/80 VUs, 2959 complete and 0 interrupted iterations
ramp   [   7% ] 08/80 VUs  0m10.7s/2m30.0s

running (0m11.8s), 08/80 VUs, 3428 complete and 0 interrupted iterations
ramp   [   8% ] 08/80 VUs  0m11.7s/2m30.0s

running (0m12.8s), 09/80 VUs, 3929 complete and 0 interrupted iterations
ramp   [   8% ] 09/80 VUs  0m12.7s/2m30.0s

running (0m13.8s), 10/80 VUs, 4415 complete and 0 interrupted iterations
ramp   [   9% ] 10/80 VUs  0m13.7s/2m30.0s

running (0m14.8s), 10/80 VUs, 4824 complete and 0 interrupted iterations
ramp   [  10% ] 10/80 VUs  0m14.7s/2m30.0s

running (0m15.8s), 11/80 VUs, 5343 complete and 0 interrupted iterations
ramp   [  10% ] 11/80 VUs  0m15.7s/2m30.0s

running (0m16.8s), 11/80 VUs, 5754 complete and 0 interrupted iterations
ramp   [  11% ] 11/80 VUs  0m16.7s/2m30.0s

running (0m17.8s), 12/80 VUs, 6302 complete and 0 interrupted iterations
ramp   [  12% ] 12/80 VUs  0m17.7s/2m30.0s

running (0m18.8s), 13/80 VUs, 6811 complete and 0 interrupted iterations
ramp   [  12% ] 13/80 VUs  0m18.7s/2m30.0s

running (0m19.8s), 13/80 VUs, 7288 complete and 0 interrupted iterations
ramp   [  13% ] 13/80 VUs  0m19.7s/2m30.0s

running (0m20.8s), 14/80 VUs, 7836 complete and 0 interrupted iterations
ramp   [  14% ] 14/80 VUs  0m20.7s/2m30.0s

running (0m21.8s), 15/80 VUs, 8342 complete and 0 interrupted iterations
ramp   [  14% ] 15/80 VUs  0m21.7s/2m30.0s

running (0m22.8s), 15/80 VUs, 8922 complete and 0 interrupted iterations
ramp   [  15% ] 15/80 VUs  0m22.7s/2m30.0s

running (0m23.8s), 16/80 VUs, 9409 complete and 0 interrupted iterations
ramp   [  16% ] 16/80 VUs  0m23.7s/2m30.0s

running (0m24.8s), 17/80 VUs, 9968 complete and 0 interrupted iterations
ramp   [  16% ] 17/80 VUs  0m24.7s/2m30.0s

running (0m25.8s), 17/80 VUs, 10571 complete and 0 interrupted iterations
ramp   [  17% ] 17/80 VUs  0m25.7s/2m30.0s

running (0m26.8s), 18/80 VUs, 11034 complete and 0 interrupted iterations
ramp   [  18% ] 18/80 VUs  0m26.7s/2m30.0s

running (0m27.8s), 19/80 VUs, 11532 complete and 0 interrupted iterations
ramp   [  18% ] 19/80 VUs  0m27.7s/2m30.0s

running (0m28.8s), 19/80 VUs, 12068 complete and 0 interrupted iterations
ramp   [  19% ] 19/80 VUs  0m28.7s/2m30.0s

running (0m29.8s), 20/80 VUs, 12457 complete and 0 interrupted iterations
ramp   [  20% ] 20/80 VUs  0m29.7s/2m30.0s

running (0m30.8s), 21/80 VUs, 13065 complete and 0 interrupted iterations
ramp   [  20% ] 21/80 VUs  0m30.7s/2m30.0s

running (0m31.8s), 21/80 VUs, 13665 complete and 0 interrupted iterations
ramp   [  21% ] 21/80 VUs  0m31.7s/2m30.0s

running (0m32.8s), 22/80 VUs, 14218 complete and 0 interrupted iterations
ramp   [  22% ] 22/80 VUs  0m32.7s/2m30.0s

running (0m33.8s), 23/80 VUs, 14725 complete and 0 interrupted iterations
ramp   [  22% ] 23/80 VUs  0m33.7s/2m30.0s

running (0m34.8s), 23/80 VUs, 15197 complete and 0 interrupted iterations
ramp   [  23% ] 23/80 VUs  0m34.7s/2m30.0s

running (0m35.8s), 24/80 VUs, 15819 complete and 0 interrupted iterations
ramp   [  24% ] 24/80 VUs  0m35.7s/2m30.0s

running (0m36.8s), 25/80 VUs, 16366 complete and 0 interrupted iterations
ramp   [  24% ] 25/80 VUs  0m36.7s/2m30.0s

running (0m37.8s), 25/80 VUs, 16820 complete and 0 interrupted iterations
ramp   [  25% ] 25/80 VUs  0m37.7s/2m30.0s

running (0m38.8s), 26/80 VUs, 17347 complete and 0 interrupted iterations
ramp   [  26% ] 26/80 VUs  0m38.7s/2m30.0s

running (0m39.8s), 27/80 VUs, 17864 complete and 0 interrupted iterations
ramp   [  26% ] 27/80 VUs  0m39.7s/2m30.0s

running (0m40.8s), 27/80 VUs, 18435 complete and 0 interrupted iterations
ramp   [  27% ] 27/80 VUs  0m40.7s/2m30.0s

running (0m41.8s), 28/80 VUs, 19012 complete and 0 interrupted iterations
ramp   [  28% ] 28/80 VUs  0m41.7s/2m30.0s

running (0m42.8s), 29/80 VUs, 19582 complete and 0 interrupted iterations
ramp   [  28% ] 29/80 VUs  0m42.7s/2m30.0s

running (0m43.8s), 29/80 VUs, 20107 complete and 0 interrupted iterations
ramp   [  29% ] 29/80 VUs  0m43.7s/2m30.0s

running (0m44.8s), 30/80 VUs, 20675 complete and 0 interrupted iterations
ramp   [  30% ] 30/80 VUs  0m44.7s/2m30.0s

running (0m45.8s), 31/80 VUs, 21235 complete and 0 interrupted iterations
ramp   [  30% ] 31/80 VUs  0m45.7s/2m30.0s

running (0m46.8s), 31/80 VUs, 21881 complete and 0 interrupted iterations
ramp   [  31% ] 31/80 VUs  0m46.7s/2m30.0s

running (0m47.8s), 32/80 VUs, 22362 complete and 0 interrupted iterations
ramp   [  32% ] 32/80 VUs  0m47.7s/2m30.0s

running (0m48.8s), 33/80 VUs, 22913 complete and 0 interrupted iterations
ramp   [  32% ] 33/80 VUs  0m48.7s/2m30.0s

running (0m49.8s), 33/80 VUs, 23436 complete and 0 interrupted iterations
ramp   [  33% ] 33/80 VUs  0m49.7s/2m30.0s

running (0m50.8s), 34/80 VUs, 23915 complete and 0 interrupted iterations
ramp   [  34% ] 34/80 VUs  0m50.7s/2m30.0s

running (0m51.8s), 35/80 VUs, 24522 complete and 0 interrupted iterations
ramp   [  34% ] 35/80 VUs  0m51.7s/2m30.0s

running (0m52.8s), 35/80 VUs, 25111 complete and 0 interrupted iterations
ramp   [  35% ] 35/80 VUs  0m52.7s/2m30.0s

running (0m53.8s), 36/80 VUs, 25634 complete and 0 interrupted iterations
ramp   [  36% ] 36/80 VUs  0m53.7s/2m30.0s

running (0m54.8s), 36/80 VUs, 26181 complete and 0 interrupted iterations
ramp   [  36% ] 36/80 VUs  0m54.7s/2m30.0s

running (0m55.8s), 37/80 VUs, 26814 complete and 0 interrupted iterations
ramp   [  37% ] 37/80 VUs  0m55.7s/2m30.0s

running (0m56.8s), 38/80 VUs, 27402 complete and 0 interrupted iterations
ramp   [  38% ] 38/80 VUs  0m56.7s/2m30.0s

running (0m57.8s), 38/80 VUs, 27922 complete and 0 interrupted iterations
ramp   [  38% ] 38/80 VUs  0m57.7s/2m30.0s

running (0m58.8s), 39/80 VUs, 28414 complete and 0 interrupted iterations
ramp   [  39% ] 39/80 VUs  0m58.7s/2m30.0s

running (0m59.8s), 40/80 VUs, 28931 complete and 0 interrupted iterations
ramp   [  40% ] 40/80 VUs  0m59.7s/2m30.0s

running (1m00.8s), 40/80 VUs, 29570 complete and 0 interrupted iterations
ramp   [  40% ] 40/80 VUs  1m00.7s/2m30.0s

running (1m01.8s), 41/80 VUs, 30153 complete and 0 interrupted iterations
ramp   [  41% ] 41/80 VUs  1m01.7s/2m30.0s

running (1m02.8s), 42/80 VUs, 30719 complete and 0 interrupted iterations
ramp   [  42% ] 42/80 VUs  1m02.7s/2m30.0s

running (1m03.8s), 42/80 VUs, 31296 complete and 0 interrupted iterations
ramp   [  42% ] 42/80 VUs  1m03.7s/2m30.0s

running (1m04.8s), 43/80 VUs, 31806 complete and 0 interrupted iterations
ramp   [  43% ] 43/80 VUs  1m04.7s/2m30.0s

running (1m05.8s), 44/80 VUs, 32401 complete and 0 interrupted iterations
ramp   [  44% ] 44/80 VUs  1m05.7s/2m30.0s

running (1m06.8s), 44/80 VUs, 32891 complete and 0 interrupted iterations
ramp   [  44% ] 44/80 VUs  1m06.7s/2m30.0s

running (1m07.8s), 45/80 VUs, 33504 complete and 0 interrupted iterations
ramp   [  45% ] 45/80 VUs  1m07.7s/2m30.0s

running (1m08.8s), 46/80 VUs, 33822 complete and 0 interrupted iterations
ramp   [  46% ] 46/80 VUs  1m08.7s/2m30.0s

running (1m09.8s), 46/80 VUs, 34366 complete and 0 interrupted iterations
ramp   [  46% ] 46/80 VUs  1m09.7s/2m30.0s

running (1m10.8s), 47/80 VUs, 34987 complete and 0 interrupted iterations
ramp   [  47% ] 47/80 VUs  1m10.7s/2m30.0s

running (1m11.8s), 48/80 VUs, 35431 complete and 0 interrupted iterations
ramp   [  48% ] 48/80 VUs  1m11.7s/2m30.0s

running (1m12.8s), 48/80 VUs, 36079 complete and 0 interrupted iterations
ramp   [  48% ] 48/80 VUs  1m12.7s/2m30.0s

running (1m13.8s), 49/80 VUs, 36511 complete and 0 interrupted iterations
ramp   [  49% ] 49/80 VUs  1m13.7s/2m30.0s

running (1m14.8s), 50/80 VUs, 37128 complete and 0 interrupted iterations
ramp   [  50% ] 50/80 VUs  1m14.7s/2m30.0s

running (1m15.8s), 50/80 VUs, 37794 complete and 0 interrupted iterations
ramp   [  50% ] 50/80 VUs  1m15.7s/2m30.0s

running (1m16.8s), 51/80 VUs, 38334 complete and 0 interrupted iterations
ramp   [  51% ] 51/80 VUs  1m16.7s/2m30.0s

running (1m17.8s), 52/80 VUs, 38971 complete and 0 interrupted iterations
ramp   [  52% ] 52/80 VUs  1m17.7s/2m30.0s

running (1m18.8s), 52/80 VUs, 39398 complete and 0 interrupted iterations
ramp   [  52% ] 52/80 VUs  1m18.7s/2m30.0s

running (1m19.8s), 53/80 VUs, 39887 complete and 0 interrupted iterations
ramp   [  53% ] 53/80 VUs  1m19.7s/2m30.0s

running (1m20.8s), 54/80 VUs, 40559 complete and 0 interrupted iterations
ramp   [  54% ] 54/80 VUs  1m20.7s/2m30.0s

running (1m21.8s), 54/80 VUs, 41127 complete and 0 interrupted iterations
ramp   [  54% ] 54/80 VUs  1m21.7s/2m30.0s

running (1m22.8s), 55/80 VUs, 41763 complete and 0 interrupted iterations
ramp   [  55% ] 55/80 VUs  1m22.7s/2m30.0s

running (1m23.8s), 56/80 VUs, 42251 complete and 0 interrupted iterations
ramp   [  56% ] 56/80 VUs  1m23.7s/2m30.0s

running (1m24.8s), 56/80 VUs, 42861 complete and 0 interrupted iterations
ramp   [  56% ] 56/80 VUs  1m24.7s/2m30.0s

running (1m25.8s), 57/80 VUs, 43447 complete and 0 interrupted iterations
ramp   [  57% ] 57/80 VUs  1m25.7s/2m30.0s

running (1m26.8s), 58/80 VUs, 44011 complete and 0 interrupted iterations
ramp   [  58% ] 58/80 VUs  1m26.7s/2m30.0s

running (1m27.8s), 58/80 VUs, 44644 complete and 0 interrupted iterations
ramp   [  58% ] 58/80 VUs  1m27.7s/2m30.0s

running (1m28.8s), 59/80 VUs, 45109 complete and 0 interrupted iterations
ramp   [  59% ] 59/80 VUs  1m28.7s/2m30.0s

running (1m29.8s), 60/80 VUs, 45576 complete and 0 interrupted iterations
ramp   [  60% ] 60/80 VUs  1m29.7s/2m30.0s

running (1m30.8s), 60/80 VUs, 46226 complete and 0 interrupted iterations
ramp   [  60% ] 60/80 VUs  1m30.7s/2m30.0s

running (1m31.8s), 61/80 VUs, 46740 complete and 0 interrupted iterations
ramp   [  61% ] 61/80 VUs  1m31.7s/2m30.0s

running (1m32.8s), 62/80 VUs, 47344 complete and 0 interrupted iterations
ramp   [  62% ] 62/80 VUs  1m32.7s/2m30.0s

running (1m33.8s), 62/80 VUs, 47803 complete and 0 interrupted iterations
ramp   [  62% ] 62/80 VUs  1m33.7s/2m30.0s

running (1m34.8s), 63/80 VUs, 48418 complete and 0 interrupted iterations
ramp   [  63% ] 63/80 VUs  1m34.7s/2m30.0s

running (1m35.8s), 63/80 VUs, 49014 complete and 0 interrupted iterations
ramp   [  64% ] 63/80 VUs  1m35.7s/2m30.0s

running (1m36.8s), 64/80 VUs, 49538 complete and 0 interrupted iterations
ramp   [  64% ] 64/80 VUs  1m36.7s/2m30.0s

running (1m37.8s), 65/80 VUs, 50160 complete and 0 interrupted iterations
ramp   [  65% ] 65/80 VUs  1m37.7s/2m30.0s

running (1m38.8s), 65/80 VUs, 50647 complete and 0 interrupted iterations
ramp   [  66% ] 65/80 VUs  1m38.7s/2m30.0s

running (1m39.8s), 66/80 VUs, 51168 complete and 0 interrupted iterations
ramp   [  66% ] 66/80 VUs  1m39.7s/2m30.0s

running (1m40.8s), 67/80 VUs, 51827 complete and 0 interrupted iterations
ramp   [  67% ] 67/80 VUs  1m40.7s/2m30.0s

running (1m41.8s), 67/80 VUs, 52350 complete and 0 interrupted iterations
ramp   [  68% ] 67/80 VUs  1m41.7s/2m30.0s

running (1m42.8s), 68/80 VUs, 53035 complete and 0 interrupted iterations
ramp   [  68% ] 68/80 VUs  1m42.7s/2m30.0s

running (1m43.8s), 69/80 VUs, 53537 complete and 0 interrupted iterations
ramp   [  69% ] 69/80 VUs  1m43.7s/2m30.0s

running (1m44.8s), 69/80 VUs, 54154 complete and 0 interrupted iterations
ramp   [  70% ] 69/80 VUs  1m44.7s/2m30.0s

running (1m45.8s), 70/80 VUs, 54745 complete and 0 interrupted iterations
ramp   [  70% ] 70/80 VUs  1m45.7s/2m30.0s

running (1m46.8s), 71/80 VUs, 55305 complete and 0 interrupted iterations
ramp   [  71% ] 71/80 VUs  1m46.7s/2m30.0s

running (1m47.8s), 71/80 VUs, 55920 complete and 0 interrupted iterations
ramp   [  72% ] 71/80 VUs  1m47.7s/2m30.0s

running (1m48.8s), 72/80 VUs, 56399 complete and 0 interrupted iterations
ramp   [  72% ] 72/80 VUs  1m48.7s/2m30.0s

running (1m49.8s), 73/80 VUs, 56855 complete and 0 interrupted iterations
ramp   [  73% ] 73/80 VUs  1m49.7s/2m30.0s

running (1m50.8s), 73/80 VUs, 57505 complete and 0 interrupted iterations
ramp   [  74% ] 73/80 VUs  1m50.7s/2m30.0s

running (1m51.8s), 74/80 VUs, 58020 complete and 0 interrupted iterations
ramp   [  74% ] 74/80 VUs  1m51.7s/2m30.0s

running (1m52.8s), 75/80 VUs, 58680 complete and 0 interrupted iterations
ramp   [  75% ] 75/80 VUs  1m52.7s/2m30.0s

running (1m53.8s), 75/80 VUs, 59168 complete and 0 interrupted iterations
ramp   [  76% ] 75/80 VUs  1m53.7s/2m30.0s

running (1m54.8s), 76/80 VUs, 59727 complete and 0 interrupted iterations
ramp   [  76% ] 76/80 VUs  1m54.7s/2m30.0s

running (1m55.8s), 77/80 VUs, 60377 complete and 0 interrupted iterations
ramp   [  77% ] 77/80 VUs  1m55.7s/2m30.0s

running (1m56.8s), 77/80 VUs, 60914 complete and 0 interrupted iterations
ramp   [  78% ] 77/80 VUs  1m56.7s/2m30.0s

running (1m57.8s), 78/80 VUs, 61550 complete and 0 interrupted iterations
ramp   [  78% ] 78/80 VUs  1m57.7s/2m30.0s

running (1m58.8s), 79/80 VUs, 62063 complete and 0 interrupted iterations
ramp   [  79% ] 79/80 VUs  1m58.7s/2m30.0s

running (1m59.9s), 79/80 VUs, 62591 complete and 0 interrupted iterations
ramp   [  80% ] 79/80 VUs  1m59.7s/2m30.0s

running (2m00.8s), 80/80 VUs, 63042 complete and 0 interrupted iterations
ramp   [  80% ] 80/80 VUs  2m00.7s/2m30.0s

running (2m01.8s), 80/80 VUs, 63644 complete and 0 interrupted iterations
ramp   [  81% ] 80/80 VUs  2m01.7s/2m30.0s

running (2m02.8s), 80/80 VUs, 64316 complete and 0 interrupted iterations
ramp   [  82% ] 80/80 VUs  2m02.7s/2m30.0s

running (2m03.8s), 80/80 VUs, 64834 complete and 0 interrupted iterations
ramp   [  82% ] 80/80 VUs  2m03.7s/2m30.0s

running (2m04.8s), 80/80 VUs, 65405 complete and 0 interrupted iterations
ramp   [  83% ] 80/80 VUs  2m04.7s/2m30.0s

running (2m05.8s), 80/80 VUs, 66039 complete and 0 interrupted iterations
ramp   [  84% ] 80/80 VUs  2m05.7s/2m30.0s

running (2m06.8s), 80/80 VUs, 66625 complete and 0 interrupted iterations
ramp   [  84% ] 80/80 VUs  2m06.7s/2m30.0s

running (2m07.8s), 80/80 VUs, 67153 complete and 0 interrupted iterations
ramp   [  85% ] 80/80 VUs  2m07.7s/2m30.0s

running (2m08.8s), 80/80 VUs, 67547 complete and 0 interrupted iterations
ramp   [  86% ] 80/80 VUs  2m08.7s/2m30.0s

running (2m09.8s), 80/80 VUs, 68004 complete and 0 interrupted iterations
ramp   [  86% ] 80/80 VUs  2m09.7s/2m30.0s

running (2m10.8s), 80/80 VUs, 68468 complete and 0 interrupted iterations
ramp   [  87% ] 80/80 VUs  2m10.7s/2m30.0s

running (2m11.8s), 80/80 VUs, 68974 complete and 0 interrupted iterations
ramp   [  88% ] 80/80 VUs  2m11.7s/2m30.0s

running (2m12.8s), 80/80 VUs, 69526 complete and 0 interrupted iterations
ramp   [  88% ] 80/80 VUs  2m12.7s/2m30.0s

running (2m13.8s), 80/80 VUs, 70134 complete and 0 interrupted iterations
ramp   [  89% ] 80/80 VUs  2m13.7s/2m30.0s

running (2m14.8s), 80/80 VUs, 70639 complete and 0 interrupted iterations
ramp   [  90% ] 80/80 VUs  2m14.7s/2m30.0s

running (2m15.8s), 80/80 VUs, 71217 complete and 0 interrupted iterations
ramp   [  90% ] 80/80 VUs  2m15.7s/2m30.0s

running (2m16.8s), 80/80 VUs, 71845 complete and 0 interrupted iterations
ramp   [  91% ] 80/80 VUs  2m16.7s/2m30.0s

running (2m17.8s), 80/80 VUs, 72468 complete and 0 interrupted iterations
ramp   [  92% ] 80/80 VUs  2m17.7s/2m30.0s

running (2m18.8s), 80/80 VUs, 72996 complete and 0 interrupted iterations
ramp   [  92% ] 80/80 VUs  2m18.7s/2m30.0s

running (2m19.8s), 80/80 VUs, 73456 complete and 0 interrupted iterations
ramp   [  93% ] 80/80 VUs  2m19.7s/2m30.0s

running (2m20.8s), 80/80 VUs, 74037 complete and 0 interrupted iterations
ramp   [  94% ] 80/80 VUs  2m20.7s/2m30.0s

running (2m21.8s), 80/80 VUs, 74647 complete and 0 interrupted iterations
ramp   [  94% ] 80/80 VUs  2m21.7s/2m30.0s

running (2m22.8s), 80/80 VUs, 75158 complete and 0 interrupted iterations
ramp   [  95% ] 80/80 VUs  2m22.7s/2m30.0s

running (2m23.8s), 80/80 VUs, 75733 complete and 0 interrupted iterations
ramp   [  96% ] 80/80 VUs  2m23.7s/2m30.0s

running (2m24.8s), 80/80 VUs, 76236 complete and 0 interrupted iterations
ramp   [  96% ] 80/80 VUs  2m24.7s/2m30.0s

running (2m25.9s), 80/80 VUs, 76848 complete and 0 interrupted iterations
ramp   [  97% ] 80/80 VUs  2m25.7s/2m30.0s

running (2m26.8s), 80/80 VUs, 77401 complete and 0 interrupted iterations
ramp   [  98% ] 80/80 VUs  2m26.7s/2m30.0s

running (2m27.8s), 80/80 VUs, 77945 complete and 0 interrupted iterations
ramp   [  98% ] 80/80 VUs  2m27.7s/2m30.0s

running (2m28.8s), 80/80 VUs, 78465 complete and 0 interrupted iterations
ramp   [  99% ] 80/80 VUs  2m28.7s/2m30.0s

running (2m29.8s), 80/80 VUs, 79036 complete and 0 interrupted iterations
ramp   [ 100% ] 80/80 VUs  2m29.7s/2m30.0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<1.0' rate=0.00%

    webhook_trigger_ms
    ✓ 'p(95)<60000' p(95)=213.14ms


  █ TOTAL RESULTS 

    checks_total.......: 158604  1055.019293/s
    checks_succeeded...: 100.00% 158604 out of 158604
    checks_failed......: 0.00%   0 out of 158604

    ✓ register 201
    ✓ workflow 201
    ✓ graph 200
    ✓ webhook 201
    ✓ accepted 202
    ✓ not 5xx

    CUSTOM
    webhook_accepted_202...........: 79300 527.496343/s
    webhook_trigger_ms.............: avg=90.54ms min=1.1ms  med=70.34ms max=614.07ms p(90)=185.85ms p(95)=213.14ms

    HTTP
    http_req_duration..............: avg=90.53ms min=1.1ms  med=70.34ms max=614.07ms p(90)=185.85ms p(95)=213.14ms
      { expected_response:true }...: avg=90.53ms min=1.1ms  med=70.34ms max=614.07ms p(90)=185.85ms p(95)=213.14ms
    http_req_failed................: 0.00% 0 out of 79305
    http_reqs......................: 79305 527.529602/s

    EXECUTION
    iteration_duration.............: avg=90.9ms  min=1.19ms med=70.72ms max=614.17ms p(90)=186.22ms p(95)=213.54ms
    iterations.....................: 79300 527.496343/s
    vus............................: 80    min=1          max=80
    vus_max........................: 80    min=80         max=80

    NETWORK
    data_received..................: 56 MB 374 kB/s
    data_sent......................: 15 MB 102 kB/s



running (2m30.3s), 00/80 VUs, 79300 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 00/80 VUs  2m30s